be/app/controllers/api/carts_controller.rb

    def index
      cart_price = 0
      user_cart = current_user.carts
      user_cart.map do |cart|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", "29bd1f82-7d0a-41f5-bc46-5acf96f8e573"]]

    def add_item
      product = Product.find(params[:product_id])
      item = current_user.carts.find_or_initialize_by(product_id: product.id)
      if item.persisted?
        item.quantity += 1
        item.save
      else
        item.quantity = 1
        item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "646f2844-50b1-447c-98a3-72c8d453b2a8"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."product_id" = $2 LIMIT $3  [["user_id", "29bd1f82-7d0a-41f5-bc46-5acf96f8e573"], ["product_id", "e7a17c55-304a-4c61-8f12-e883a73322d4"], ["LIMIT", 1]]
UPDATE "carts" SET "updated_at" = $1, "quantity" = $2 WHERE "carts"."id" = $3  [["updated_at", "2022-07-13 06:20:13.527810"], ["quantity", 2], ["id", "9bc78fb6-8874-4785-aad7-90ffb3db479b"]]
UPDATE "carts" SET "updated_at" = $1, "quantity" = $2 WHERE "carts"."id" = $3  [["updated_at", "2022-07-13 06:05:55.928421"], ["quantity", 2], ["id", "3937c5d8-6036-4bde-ac7f-fe460c53d7fc"]]

    def deduct_item
      cart = current_user.carts
      item = cart.find_by(product_id: params[:product_id])
      if item.quantity > 1
        item.quantity -= 1
        item.save
      else
        item.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."product_id" = $1 AND "carts"."user_id" = $2 LIMIT $3  [["product_id", "cbb32259-b10e-435f-b60b-385b7fd40695"], ["user_id", "29bd1f82-7d0a-41f5-bc46-5acf96f8e573"], ["LIMIT", 1]]
UPDATE "carts" SET "updated_at" = $1, "quantity" = $2 WHERE "carts"."id" = $3  [["updated_at", "2022-07-13 06:18:40.209938"], ["quantity", 1], ["id", "3937c5d8-6036-4bde-ac7f-fe460c53d7fc"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", "5fa48608-55df-4a69-af27-b2edac60785f"]]

    def checkout
      cart = current_user.carts
      cart.each do |item|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", "29bd1f82-7d0a-41f5-bc46-5acf96f8e573"]]