be/app/controllers/api/products_controller.rb

    def index
      products = Product.all
      if params[:category_id].present?
        products = products.where(category_id: params[:category_id])
---
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", "7dc31fca-8484-4792-a765-872a62a92d3c"]]