be/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "29bd1f82-7d0a-41f5-bc46-5acf96f8e573"], ["LIMIT", 1]]
---
  def current_user
    if decoded_token()
      user_id = decoded_token[0]['user_id']
      @user = User.find_by(id: user_id)